/*********************************Copyright(C)********************************
*-------------------------------File Information------------------------------
* FileName          : device_control_can.h
* Author            : Yuan.Zong
* Version           : V1.0.0/2026.05.14
* Description       :
******************************************************************************/
/* ==============================  INCLUDES  =============================== */
#include "cmsis_os.h"

#include "can_protocol_handle.h"
/* ==============================  DEFINES   =============================== */

/* ==============================   ENUMS    =============================== */

/* ======================== STRUCTURES AND UNIONS ========================== */

/* ==============================  EXTERNS   =============================== */

/* ========================= FUNCTION PROTOTYPES =========================== */
/*****************************************************************************************************
*Function   :APL_Task(应用层任务)
*Description:负责即使运行维持应用层功能的正常运行，当前主要为CAN协议处理任务，后续可增加其他应用层任务。
*Input      :
*Output     :
*Returns    :
*Note       :
*****************************************************************************************************/
void APL_Task(void *argument)
{
    /* USER CODE BEGIN APL_Task */
    /* Infinite loop */
    for(;;)
    {
        osDelay(1);
        can_protocol_handle_task();
    }
    /* USER CODE END APL_Task */
}
/***************** (C)COPYRIGHT 2022 XXXXXXXX*****END OF FILE*****************/
