/*********************************Copyright(C)********************************
*-------------------------------File Information------------------------------
* FileName          : voyah_ble.h
* Author            : Yuan.Zong
* Version           : V1.0.0
* Description       : 
******************************************************************************/
#ifndef __VOYAH_BLE_H__
#define __VOYAH_BLE_H__
/* ==============================  INCLUDES  =============================== */
#include "share_data.h"
/* ==============================  DEFINES   =============================== */

/* ==============================   ENUMS    =============================== */

/* ======================== STRUCTURES AND UNIONS ========================== */
/* BLE报文信息属性*/
typedef struct
{
   uint8_t   pgn;             /*报文PGN*/
   uint8_t   size;            /*数据长度*/
   uint16_t  send_cycle;      /*报文默认发送周期*/
   uint16_t  send_time;       /*报文默认发送次数*/
   uint16_t  send_cycle2;    /*报文临时发送周期，一般用于特定场景要求周期变化*/
   uint16_t  send_time2;     /*总发送次数，一般用于报文发送达到时间后停止*/
}ble_frame_attribute_t;

/*BLE报文发送定时器结构体*/
typedef struct
{
    uint16_t  send_timer;        /*默认周期发送定时器*/
    uint16_t  send_count;        /*默认发送计数器*/
    uint16_t  send_timer2;       /*临时周期发送定时器*/
    uint16_t  send_count2;       /*临时发送计数器*/
}ble_frame_send_timer_t;
/* ==============================  EXTERNS   =============================== */


/* ========================= FUNCTION PROTOTYPES =========================== */
/*****************************************************************************************************
*Function   :
*Description:
*Input      :
*Output     :
*Returns    :
*Note       :
*****************************************************************************************************/


#endif
/***************** (C)COPYRIGHT 2022 XXXXXXXX*****END OF FILE*****************/
