/*********************************Copyright(C)********************************
*-------------------------------File Information------------------------------
* FileName          : voyah_rf.h
* Author            : Yuan.Zong
* Version           : V1.0.0
* Description       : 
******************************************************************************/
#ifndef __VOYAH_RF_H__
#define __VOYAH_RF_H__
/* ==============================  INCLUDES  =============================== */
#include "uart_bus.h"
/* ==============================  DEFINES   =============================== */
#define DEBUG_BLE03           /*debug使能，完整保留“DEBUG_BLE03”为使能debug*/
//#define BLE_SEND_INTERVAL      200     /*两帧之间发送的最小间隔 ms*/


#define ZSC_RFPOWER99          "ZSC+RFPOWER:99\r\n"
#define ZSC_RFPOWER12          "ZSC+RFPOWER:12\r\n"
#define ZSC_SWR                "ZSC+SWR\r\n"

/* ==============================   ENUMS    =============================== */

/* ======================== STRUCTURES AND UNIONS ========================== */

/* ==============================  EXTERNS   =============================== */


/* ========================= FUNCTION PROTOTYPES =========================== */
/*****************************************************************************************************
*Function   :
*Description:
*Input      :
*Output     :
*Returns    :
*Note       :
*****************************************************************************************************/
void rf_command_send(void);

#endif
/***************** (C)COPYRIGHT 2022 XXXXXXXX*****END OF FILE*****************/
