/*********************************Copyright(C)********************************
*-------------------------------File Information------------------------------
* FileName          : voyah_ble.c
* Author            : Yuan.Zong
* Version           : V1.0.0/2026.05.30
* Description       :
******************************************************************************/
/* ==============================  INCLUDES  =============================== */
#include "voyah_ble.h"
/* ==============================  DEFINES   =============================== */

/* ==============================   ENUMS    =============================== */

/* ======================== STRUCTURES AND UNIONS ========================== */

/* ==============================  EXTERNS   =============================== */
/*对蓝牙报文属性进行定义*/
const ble_frame_attribute_t ble_frame_attribute[BLE_FRAME_MAX] = 
{               /*           PGN         长度      默认发送周期  默认发送次数  临时发送周期  临时发送次数    */
   /*BLE_AUTHOR*/          { 0x01,        3,        250,        0xFFFF,      250,         0xFFFF     },
   /*BLE_AUTHOR_ACK1*/     { 0x01,        2,        250,        0xFFFF,      250,         0xFFFF     },
   /*BLE_AUTHOR_ACK2*/     { 0x02,        8,        250,        0xFFFF,      250,         0xFFFF     },
   /*BLE_AUTO_CHARGE*/     { 0x03,        41,       250,        0xFFFF,      250,         0xFFFF     },
   /*BLE_AUTO_CHARGE_ACK*/ { 0x03,        13,       500,        0xFFFF,      500,         0xFFFF     },
};

/*定义所有枪及其所有蓝牙报文的发送定时器*/
ble_frame_send_timer_t ble_frame_send_timer[CHAR_GUN_NUM][BLE_FRAME_MAX] = {0};     /*蓝牙报文发送定时器*/
/* ========================= FUNCTION PROTOTYPES =========================== */
/*****************************************************************************************************
*Function   :
*Description:
*Input      :
*Output     :
*Returns    :
*Note       :
*****************************************************************************************************/

/***************** (C)COPYRIGHT 2022 XXXXXXXX*****END OF FILE*****************/
