/*********************************Copyright(C)********************************
*-------------------------------File Information------------------------------
* FileName          : J1939.h
* Author            : Yuan.Zong
* Version           : V1.0.0
* Description       : 1、由于本协议栈队列形式为内部全局变量，所以会比较占用堆栈空间，如果程序编译发现堆栈空间不足，
                      则可尝试调整下面几个宏定义值大小来尝试兼容，亦可调整CAN_BUS中实际用到的CAN通道数量。
                      2、该J1939协议栈当前在一个CAN通道内仅支持接收和发送各同时进行1个多帧传输，这点需要注意。
                      3、暂时未对J1939协议中PDU2部分进行处理，以及未支持TP.CM BAM传输。
                      4、本功能模块强依赖前级的CAN_BUS功能模块，请配合使用。
******************************************************************************/
#ifndef _J1939_H_
#define _J1939_H_
/* ==============================  INCLUDES  =============================== */
#include "can_bus.h"       /*强依赖，必须配合使用*/

#pragma anon_unions        /*启用对匿名联合体/结构体的支持*/
/* ==============================  DEFINES   =============================== */
#define MAX_PACK_PER_TIME       12    /*单轮最大可连续传输数据包数量*/
#define MAX_J1939_MESSAGE       350   /*定义J1939支持传输的最大数据量，单位byte*/
#define J1939_DATA_QUEUE_NUM    5     /*J1939数据数据队列数量*/

#define DEBUG_J1939           /*debug使能，完整保留“DEBUG_J1939”为使能debug*/
/* ==============================   ENUMS    =============================== */

/* ======================== STRUCTURES AND UNIONS ========================== */

/* J1939数据结构体*/
typedef struct
{
    uint8_t       p;           /*优先级*/
    uint8_t       pgn;         /*参数组编号*/
    uint8_t       da;          /*目标地址*/
    uint8_t       sa;          /*源地址*/
    uint16_t      len;         /*数据长度*/
    union
    {
        uint8_t   data_s[8];                      /*单帧数据Single-frame message*/
        uint8_t   data_m[MAX_J1939_MESSAGE];      /*多帧数据Multi-frame message*/
    };
}J1939_Data;

/* ==============================  EXTERNS   =============================== */

/* ========================= FUNCTION PROTOTYPES =========================== */
/*功能实现接口函数*/
/*****************************************************************************************************
*Function   :J1939_rx_dequeue（J1939接收出队函数）
*Description:这是一个CAN数据接收的出队函数，通常需要在后级的协议栈层级或者直接在数据解析层级调用将数据取出处理。
*Input      :CAN_CHNL       chnl   CAN通道
*Output     :J1939_Data*    data   J1939接收数据结构体
*Returns    :bool值         出队结果（true成功/false失败）
*Note       :特别注意，只要使用到该协议栈，就必须及时调用该函数消费掉接收到的数据，不然会导致数据收发异常
*****************************************************************************************************/
bool J1939_rx_dequeue(CAN_CHNL chnl, J1939_Data* data);

/*****************************************************************************************************
*Function   :J1939_tx_enqueue（J1939发送入队函数）
*Description:这是一个CAN数据发送的入队函数，通常在后级的协议栈层级或者直接在数据发送等级调用将处理好的数据入队等待发送。
*Input      :CAN_CHNL       chnl   CAN通道
             J1939_Data*    data   J1939发送数据结构体
*Output     :
*Returns    :bool值         入队结果（true成功/false失败）
*Note       :
*****************************************************************************************************/
bool J1939_tx_enqueue(CAN_CHNL chnl, J1939_Data* data);

/*外侧依赖接口函数*/
/*****************************************************************************************************
*Function   :J1939_handle_task（J1939任务函数）
*Description:这是一个处理J1939数据收发的任务函数，应将其放在一个1ms周期的任务中，使其能够有效执行。
*Input      :
*Output     :
*Returns    :
*Note       :
*****************************************************************************************************/
void J1939_handle_task(void);


#endif
/***************** (C)COPYRIGHT 2022 XXXXXXXX*****END OF FILE*****************/
